{
    "app": {
        "aboutme": "About Me",
        "skills": "Skills",
        "projects": "Projects",
        "contact": "Contact"
    },
    "home": {
        "hi": "Hello, I'm Hugo",
        "job": "Full Stack Developer",
        "aboutme": "About Me",
        "skills": "Skills",
        "projects": "Projects",
        "contact": "Contact Me",
        "about1": "Hi, I'm Hugo Levacher, a student and aspiring developer with a passion for web development. While web development is my main focus, I'm also interested in other areas of programming. Mobile apps, backend systems, or game development, I'm open and excited to continue learning and growing as a developer.",
        "about2": "I love programming because it gives me the opportunity to turn my ideas into real products that I can share others. My goal is to keep expanding my skills, take on new challenges, and never stop improving.",
        "learnmore": "Learn More➨",
        "reachout": "If you'd like to get in touch, feel free to reach out via email or phone!",
        "resume": "My resume",
        "resumelink": "assets/CV_Hugo_Levacher_2025_en.pdf",
        "github": "My Github",
        "linkedin": "My LinkedIn"
    },
    "project": {
        "test": "Test project at",
        "code": "Source code at"
    },
    "data": {
        "projects": {
            "choculaterie": {
                "title": "choculaterie.com",
                "description": "An online space where users can publish and download Minecraft creations.",
                "text": [
                    "The Choculaterie is a space for Minecraft players to share their creations with other users. The website allows users to upload as soon as they create an account and always allows them to download. Registered users can also mark creations and other users as favorites to stay up to date with their favorite creators.",
                    "This website was made in collaboration with a friend. I was mostly in charge of the backend development using JavaScript, C#, ASP .NET and Microsoft Entity Framework. I built the controllers and classes necessary for the registration of users as well as the requests to the server to get the correct information.",
                    "Making this project, I learned how to securely manage user data and how to optimize requests to minimize server load and improve performance."
                ]
            },
            "mathgame": {
                "title": "Math game",
                "description": "A fun and interactive math game for kids to learn basic arithmetic.",
                "text": [
                    "This website is a simple math game for kids to learn basic arithmetic (+-X÷). The website offers 3 difficulties and 2 game modes , the infinite mode, where you try and see how far you can go and the learning mode, where you choose the number of questions and try to get the best score in %.",
                    "This website was made for my cousin, who was struggling with math. The game made him more motivated to work, so I am proud that my project helped him.",
                    "This project was made only using JavaScript, HTML and CSS."
                ]
            },
            "secretmessage": {
                "title": "Secret message",
                "description": "An app that allows users to encrypt and decrypt secret messages using AES encryption.",
                "text": [
                    "I made this AES encryption project to send funny messages to my friends and make them work to find the messages. That's it.",
                    "This project was made using C# and .NET Core. The encryption uses a randomized salt every time, so the same message will not return the same encryption string. It helped me research and understand different encryption methods and I discovered that the world of cryptography was more interesting than I thought."
                ]
            }
        }
    }
}